jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
/**
 * @author Jacob Schloss <jacob.schloss@suburbanembedded.com>
 * @copyright Copyright (c) 2019 Suburban Embedded. All rights reserved.
 * @license Licensed under the 3-Clause BSD license. See LICENSE for details
*/

#include "libusb_dev_cpp/driver/stm32/stm32_h7xx_otghs.hpp"

#include "libusb_dev_cpp/driver/cpu/Cortex_m7.hpp"

#include "STM32H7xx/Include/stm32h7xx.h"

#include "common_util/Byte_util.hpp"
#include "common_util/Register_util.hpp"

#include "freertos_cpp_util/logging/Global_logger.hpp"

#include <cinttypes>

using freertos_util::logging::Global_logger;
// using freertos_util::logging::LOG_LEVEL;

namespace
{
	static volatile USB_OTG_GlobalTypeDef* const OTG  = reinterpret_cast<volatile USB_OTG_GlobalTypeDef*>(USB_OTG_HS_PERIPH_BASE + USB_OTG_GLOBAL_BASE);
	static volatile USB_OTG_DeviceTypeDef* const OTGD = reinterpret_cast<volatile USB_OTG_DeviceTypeDef*>(USB_OTG_HS_PERIPH_BASE + USB_OTG_DEVICE_BASE);
	static volatile uint32_t* const OTGPCTL           = reinterpret_cast<volatile uint32_t*>(USB_OTG_HS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE);

	static inline volatile uint32_t* get_ep_fifo(const uint8_t ep)
	{
		return reinterpret_cast<volatile uint32_t*>(USB1_OTG_HS_PERIPH_BASE + USB_OTG_FIFO_BASE + (ep * USB_OTG_FIFO_SIZE));
	}
	static inline volatile USB_OTG_INEndpointTypeDef* get_ep_in(const uint8_t ep)
	{
		return reinterpret_cast<volatile USB_OTG_INEndpointTypeDef*>(USB1_OTG_HS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + (ep * USB_OTG_EP_REG_SIZE));
	}
	static inline volatile USB_OTG_OUTEndpointTypeDef* get_ep_out(const uint8_t ep)
	{
		return reinterpret_cast<volatile USB_OTG_OUTEndpointTypeDef*>(USB1_OTG_HS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + (ep * USB_OTG_EP_REG_SIZE));
	}
}

void stm32_h7xx_otghs::core_reset()
{
	//wait for USB to be idle
	Register_util::wait_until_set(&OTG->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL);

	//soft reset
	Register_util::set_bits(&OTG->GRSTCTL,         USB_OTG_GRSTCTL_CSRST);
	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_CSRST);

	//wait for USB to be idle
	Register_util::wait_until_set(&OTG->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL);

	for(volatile uint32_t i = 0; i < 1000; i++)
	{
		
	}
}

//you must configure the ep tx fifo in order, one after another
//eg 0, 1, 2, 3
bool stm32_h7xx_otghs::config_ep_tx_fifo(const uint8_t ep, const size_t len)
{
	if(ep != 0)
	{
		if(ep > MAX_NUM_EP)
		{
			return false;
		}

		if((len < 64) || (len > 2048))
		{
			return false;
		}

		const uint32_t DIEPTXF0_HNPTXFSIZ = OTG->DIEPTXF0_HNPTXFSIZ;
		const uint32_t ep0_fsa = _FLD2VAL(USB_OTG_TX0FSA, DIEPTXF0_HNPTXFSIZ);
		const uint32_t ep0_fd  = _FLD2VAL(USB_OTG_TX0FD , DIEPTXF0_HNPTXFSIZ);
		
		uint32_t fsa = ep0_fsa + ep0_fd;

		for(size_t i = 1; i <= ep; i++)
		{
			if(i == ep)
			{
				//length in 32bit
				const size_t len32 = (len+3U) / 4U;

				//fsa must be 32bit aligned
				if((fsa % 4) != 0)
				{
					fsa += 4 - (fsa % 4);
				}

				if((fsa + len32*4U) > MAX_FIFO_LEN_U8)
				{
					return false;
				}

				OTG->DIEPTXF[i-1] = _VAL2FLD(USB_OTG_DIEPTXF_INEPTXFD, len32) | _VAL2FLD(USB_OTG_DIEPTXF_INEPTXSA, fsa);
			}
			else
			{
				const uint32_t DIEPTXF = OTG->DIEPTXF[i-1];
				const uint32_t i_fsa = _FLD2VAL(USB_OTG_DIEPTXF_INEPTXSA, DIEPTXF);
				const uint32_t i_fd  = _FLD2VAL(USB_OTG_DIEPTXF_INEPTXFD, DIEPTXF);		

				fsa = i_fd + i_fsa;
			}
		}
	}
	else
	{
		if((len < 64) || (len > 1024))
		{
			return false;
		}

		//length in 32bit
		const size_t len32 = (len+3U) / 4U;
		uint32_t fsa = RX_FIFO_SIZE;

		//fsa might need to be 32bit aligned
		if((fsa % 4) != 0)
		{
			fsa += 4 - (fsa % 4);
		}

		if((fsa + len32*4U) > MAX_FIFO_LEN_U8)
		{
			return false;
		}

		OTG->DIEPTXF0_HNPTXFSIZ = _VAL2FLD(USB_OTG_TX0FD, len32) | _VAL2FLD(USB_OTG_TX0FSA, fsa);
	}

	return true;
}

stm32_h7xx_otghs::stm32_h7xx_otghs()
{
	m_tx_buffer = nullptr;
	m_rx_buffer = nullptr;

	m_ep0_cfg.num = 0;
	m_ep0_cfg.size = 0;
	m_ep0_cfg.type = EP_TYPE::UNCONF;

	for(size_t i = 0; i < m_rx_ep_cfg.size(); i++)
	{
		m_rx_ep_cfg[i].num = i;
		m_rx_ep_cfg[i].size = 0;
		m_rx_ep_cfg[i].type = EP_TYPE::UNCONF;
	}
	for(size_t i = 0; i < m_rx_ep_cfg.size(); i++)
	{
		m_tx_ep_cfg[i].num = i;
		m_tx_ep_cfg[i].size = 0;
		m_tx_ep_cfg[i].type = EP_TYPE::UNCONF;
	}
}
stm32_h7xx_otghs::~stm32_h7xx_otghs()
{

}

bool stm32_h7xx_otghs::initialize()
{
	if(!m_rx_buffer)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::fatal, "stm32_h7xx_otghs::initialize", "m_rx_buffer is null");
	}

	{
		Buffer_adapter_base* rx_buf = m_ep0_buffer->poll_allocate_buffer(0);
		if(rx_buf == nullptr)
		{
			Buffer_adapter_base* buf = m_ep0_buffer->get_buffer(0);
			if(buf)
			{
				m_ep0_buffer->release_buffer(0, buf);
			}

			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::fatal, "stm32_h7xx_otghs::initialize", "could not preallocate rx buffer for ep 0");

			return false;
		}

		m_ep0_buffer->set_buffer(0, rx_buf);
	}

	for(size_t i = 0; i < m_rx_buffer->get_num_ep(); i++)
	{
		Buffer_adapter_base* rx_buf = m_rx_buffer->poll_allocate_buffer(i);
		if(rx_buf == nullptr)
		{
			for(size_t j = 0; j < m_rx_buffer->get_num_ep(); j++)
			{
				Buffer_adapter_base* buf = m_rx_buffer->get_buffer(j);
				if(buf)
				{
					m_rx_buffer->release_buffer(j, buf);
				}
			}

			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::fatal, "stm32_h7xx_otghs::initialize", "could not preallocate rx buffer for ep %d", i+1);

			return false;
		}

		m_rx_buffer->set_buffer(i, rx_buf);
	}

	return true;
}

void stm32_h7xx_otghs::get_info()
{

}

bool stm32_h7xx_otghs::enable()
{
	//reset usb if it is on
	if(RCC->AHB1ENR & (RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN))
	{
		if(!disable())
		{
			return false;
		}
	}

	//enable usb core clock and ulpi clock for USB1
	Register_util::set_bits(&RCC->AHB1ENR, RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN);
	//wait for USB to be idle
	Register_util::wait_until_set(&OTG->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL);

	//disable tranciever
	Register_util::clear_bits(&(OTG->GCCFG), USB_OTG_GCCFG_PWRDWN);

	//ULPI
	Register_util::clear_bits(&(OTG->GUSBCFG), USB_OTG_GUSBCFG_TSDPS | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYSEL);
	Register_util::clear_bits(&(OTG->GUSBCFG), USB_OTG_GUSBCFG_ULPIEVBUSD | USB_OTG_GUSBCFG_ULPIEVBUSI);

	//soft reset
	core_reset();

	//soft disconnect
	Register_util::set_bits(&OTGD->DCTL, USB_OTG_DCTL_SDIS);

