jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
	//start clocks, no sleep gate
	Register_util::mask_set_bits<uint32_t>(OTGPCTL, 
		USB_OTG_PCGCR_GATEHCLK | USB_OTG_PCGCR_STPPCLK,
		(1U << 5) //ENL1GTG
		);

	//config as device
	// Register_util::clear_bits(&OTG->GUSBCFG, 
	// 	USB_OTG_GUSBCFG_PTCI       | 
	// 	USB_OTG_GUSBCFG_PCCI       | 
	// 	USB_OTG_GUSBCFG_ULPICSM    | 
	// 	USB_OTG_GUSBCFG_PHYLPCS    | 
	// 	USB_OTG_GUSBCFG_HNPCAP     | 
	// 	USB_OTG_GUSBCFG_SRPCAP
	// 	);
	Register_util::mask_set_bits(&OTG->GUSBCFG, 
		USB_OTG_GUSBCFG_FHMOD, 
		USB_OTG_GUSBCFG_FDMOD
		);
	Register_util::mask_set_bits(&OTG->GUSBCFG, 
		USB_OTG_GUSBCFG_ULPIIPD | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYLPCS | USB_OTG_GUSBCFG_SRPCAP | USB_OTG_GUSBCFG_PHYSEL,
		USB_OTG_GUSBCFG_ULPIAR | USB_OTG_GUSBCFG_ULPICSM
		);
	Register_util::mask_set_bits(&OTG->GUSBCFG, 
		USB_OTG_GUSBCFG_TRDT | USB_OTG_GUSBCFG_TOCAL,
		_VAL2FLD(USB_OTG_GUSBCFG_TRDT,   0x09) | _VAL2FLD(USB_OTG_GUSBCFG_TOCAL, 0x00));
	
	//reset since we picked a phy
	core_reset();

	//No vbus sense, power down
	Register_util::clear_bits(&OTG->GCCFG, USB_OTG_GCCFG_VBDEN | USB_OTG_GCCFG_SDEN | USB_OTG_GCCFG_PDEN | USB_OTG_GCCFG_DCDEN | USB_OTG_GCCFG_BCDEN | USB_OTG_GCCFG_PWRDWN);
	
	//force B state valid
	Register_util::mask_set_bits<uint32_t>(&OTG->GOTGCTL, 
		USB_OTG_GOTGCTL_EHEN | USB_OTG_GOTGCTL_DHNPEN | USB_OTG_GOTGCTL_HSHNPEN | USB_OTG_GOTGCTL_HNPRQ | USB_OTG_GOTGCTL_AVALOVAL | USB_OTG_GOTGCTL_AVALOEN | USB_OTG_GOTGCTL_SRQ,
		USB_OTG_GOTGCTL_OTGVER | USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL
		);

	Register_util::mask_set_bits(
		&OTGD->DCFG, 
		USB_OTG_DCFG_PERSCHIVL | USB_OTG_DCFG_PFIVL | USB_OTG_DCFG_DAD | USB_OTG_DCFG_DSPD,
		_VAL2FLD(USB_OTG_DCFG_PERSCHIVL, 0x01) | _VAL2FLD(USB_OTG_DCFG_PFIVL, 0x00) | _VAL2FLD(USB_OTG_DCFG_DAD, 0x00) | _VAL2FLD(USB_OTG_DCFG_DSPD, 0x00)
		);
	// Register_util::set_bits(&OTGD->DCFG, USB_OTG_DCFG_NZLSOHSK);


	//reset fifo assignments
	for (size_t i = 1; i < MAX_NUM_EP; i++)
	{
		OTG->DIEPTXF[i-1] = _VAL2FLD(USB_OTG_DIEPTXF_INEPTXFD, 0x0200) | _VAL2FLD(USB_OTG_DIEPTXF_INEPTXSA, 0x0200+0x0200*i);
	}

	//rx fifo
	OTG->GRXFSIZ = RX_FIFO_SIZE;
	//ep0 tx fifo, TX0FD | TX0FSA
	if(!config_ep_tx_fifo(0, 3*(64 + 8 + 4)))
	{
		return false;
	}

	//flush fifo
	flush_all_tx();
	flush_rx();

	//clear core interrupt
	OTG->GINTMSK = 0U;
	OTG->GINTSTS = 0xFFFFFFFF;

	//tx ep int
	OTGD->DAINTMSK = 0U;
	OTGD->DOEPMSK  = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM;
	OTGD->DIEPMSK  = USB_OTG_DIEPMSK_TOM   | USB_OTG_DIEPMSK_XFRCM;

	//config core interrupt
	OTG->GINTMSK  = USB_OTG_GINTMSK_WUIM     |
					USB_OTG_GINTMSK_OEPINT   |
					USB_OTG_GINTMSK_IEPINT   |
					USB_OTG_GINTMSK_ENUMDNEM |
					USB_OTG_GINTMSK_USBRST   |
    				USB_OTG_GINTMSK_USBSUSPM |
					USB_OTG_GINTMSK_ESUSPM   |
					USB_OTG_GINTMSK_RXFLVLM  |
    				//USB_OTG_GINTMSK_SOFM   |
					USB_OTG_GINTMSK_OTGINT   |
					USB_OTG_GINTMSK_MMISM
					;

	//turn on global interrupt
	Register_util::set_bits(&OTG->GAHBCFG, USB_OTG_GAHBCFG_GINT);

	return true;
}
bool stm32_h7xx_otghs::disable()
{
	if(RCC->AHB1ENR & (RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN))
	{
		//reset USB1
		Register_util::set_bits(&RCC->AHB1RSTR,   RCC_AHB1RSTR_USB1OTGHSRST);
		Register_util::clear_bits(&RCC->AHB1RSTR, RCC_AHB1RSTR_USB1OTGHSRST);

		//gate clocks
		Register_util::clear_bits(&RCC->AHB1ENR, RCC_AHB1ENR_USB1OTGHSEN | RCC_AHB1ENR_USB1OTGHSULPIEN);

		//flush pipeline
		Cortex_m7::data_instruction_sync();
	}

	return true;
}

bool stm32_h7xx_otghs::connect()
{
	Register_util::clear_bits(&OTGD->DCTL, USB_OTG_DCTL_SDIS);

	return true;
}
bool stm32_h7xx_otghs::disconnect()
{
	Register_util::set_bits(&OTGD->DCTL, USB_OTG_DCTL_SDIS);

	//flush
	Cortex_m7::data_instruction_sync();

	return true;
}

bool stm32_h7xx_otghs::set_address(const uint8_t addr)
{
	Register_util::mask_set_bits(&OTGD->DCFG, USB_OTG_DCFG_DAD, _VAL2FLD(USB_OTG_DCFG_DAD, uint32_t(addr)));

	return true;
}

bool stm32_h7xx_otghs::ep_config(const ep_cfg& ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep.num);

	if(ep_addr == 0)
	{
		if(ep.type != usb_driver_base::EP_TYPE::CONTROL)
		{
			return false;
		}

		volatile USB_OTG_INEndpointTypeDef*  const ep_in  = get_ep_in(ep_addr);
		volatile USB_OTG_OUTEndpointTypeDef* const ep_out = get_ep_out(ep_addr);

		uint8_t mpsize = 0;
		m_ep0_cfg = ep;
		if(ep.size <= 8)
		{
			m_ep0_cfg.size = 8;
			mpsize = 3;
		}
		else if(ep.size <= 16)
		{
			m_ep0_cfg.size = 16;
			mpsize = 2;
		}
		else if(ep.size <= 32)
		{
			m_ep0_cfg.size = 32;
			mpsize = 1;
		}
		else
		{
			m_ep0_cfg.size = 64;
			mpsize = 0;
		}

		OTGD->DAINTMSK |= 0x00010001;
		
		ep_in->DIEPTSIZ = 
			_VAL2FLD(USB_OTG_DIEPTSIZ_PKTCNT, 0) |
			_VAL2FLD(USB_OTG_DOEPTSIZ_XFRSIZ, m_ep0_cfg.size);

		ep_out->DOEPTSIZ = 
			_VAL2FLD(USB_OTG_DOEPTSIZ_STUPCNT, 3) |
			USB_OTG_DOEPTSIZ_PKTCNT               |
			_VAL2FLD(USB_OTG_DOEPTSIZ_XFRSIZ, m_ep0_cfg.size);
		
		// DIEPCTL0
		ep_in->DIEPCTL = 
			USB_OTG_DIEPCTL_SNAK                      | 
			_VAL2FLD(USB_OTG_DIEPCTL_EPTYP, 0x00)     | 
			USB_OTG_DIEPCTL_USBAEP                    |
			// _VAL2FLD(USB_OTG_DIEPCTL_MPSIZ, m_ep0_cfg.size);
			_VAL2FLD(USB_OTG_DIEPCTL_MPSIZ, mpsize);
		
		// DOEPCTL
		ep_out->DOEPCTL = 
			USB_OTG_DOEPCTL_EPENA                 | 
			// _VAL2FLD(USB_OTG_DOEPCTL_EPTYP, 0x00) | //hardcoded
			USB_OTG_DOEPCTL_CNAK
			// _VAL2FLD(USB_OTG_DIEPCTL_MPSIZ, mpsize); | //hardcoded to match control in 0
			;
	}
	else if(USB_common::is_in_ep(ep.num))
	{
		volatile USB_OTG_INEndpointTypeDef* const ep_in = get_ep_in(ep_addr);

		if(!config_ep_tx_fifo(ep_addr, ep.size))
		{
			return false;
		}

		//enable tx interrupt
		OTGD->DAINTMSK |= _VAL2FLD(USB_OTG_DAINTMSK_IEPM, 0x0001 << ep_addr);

		switch(ep.type)
		{
			case usb_driver_base::EP_TYPE::ISOCHRONUS:
			{
				ep_in->DIEPCTL = 
					// USB_OTG_DIEPCTL_SD0PID_SEVNFRM            | 
					USB_OTG_DIEPCTL_SNAK                      | 
					_VAL2FLD(USB_OTG_DIEPCTL_TXFNUM, ep_addr) | 
					_VAL2FLD(USB_OTG_DIEPCTL_EPTYP, 0x01)     | 
					USB_OTG_DIEPCTL_USBAEP                    | 
					_VAL2FLD(USB_OTG_DIEPCTL_MPSIZ, ep.size);
				break;
			}
			case usb_driver_base::EP_TYPE::INTERRUPT:
			{
				ep_in->DIEPCTL = 
					USB_OTG_DIEPCTL_SD0PID_SEVNFRM            | 
					USB_OTG_DIEPCTL_SNAK                      | 
					_VAL2FLD(USB_OTG_DIEPCTL_TXFNUM, ep_addr) | 
					_VAL2FLD(USB_OTG_DIEPCTL_EPTYP, 0x03)     | 
					USB_OTG_DIEPCTL_USBAEP                    | 
					_VAL2FLD(USB_OTG_DIEPCTL_MPSIZ, ep.size);
				break;
			}
			case usb_driver_base::EP_TYPE::BULK:
			{
				ep_in->DIEPCTL = 
					USB_OTG_DIEPCTL_SD0PID_SEVNFRM            | 
					USB_OTG_DIEPCTL_SNAK                      | 
					_VAL2FLD(USB_OTG_DIEPCTL_TXFNUM, ep_addr) | 
					_VAL2FLD(USB_OTG_DIEPCTL_EPTYP, 0x02)     | 
					USB_OTG_DIEPCTL_USBAEP                    | 
					_VAL2FLD(USB_OTG_DIEPCTL_MPSIZ, ep.size);
				break;
			}
			default:
			{
				return false;
			}
		}
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* const ep_out = get_ep_out(ep_addr);
		switch(ep.type)
		{
			case usb_driver_base::EP_TYPE::ISOCHRONUS:
			{
				ep_out->DOEPCTL = 
					USB_OTG_DOEPCTL_EPENA                     |
					// USB_OTG_DIEPCTL_SD0PID_SEVNFRM            | 
					USB_OTG_DIEPCTL_CNAK                      | 
					_VAL2FLD(USB_OTG_DOEPCTL_EPTYP, 0x01)     | 
					USB_OTG_DIEPCTL_USBAEP                    | 
					_VAL2FLD(USB_OTG_DOEPCTL_MPSIZ, ep.size);
				break;
			}
			case usb_driver_base::EP_TYPE::INTERRUPT:
			{
				ep_out->DOEPCTL = 
					USB_OTG_DOEPCTL_EPENA                     |
					USB_OTG_DIEPCTL_SD0PID_SEVNFRM            | 
					USB_OTG_DIEPCTL_CNAK                      | 
					_VAL2FLD(USB_OTG_DOEPCTL_EPTYP, 0x03)     | 
					USB_OTG_DIEPCTL_USBAEP                    | 
					_VAL2FLD(USB_OTG_DOEPCTL_MPSIZ, ep.size);
				break;
			}
			case usb_driver_base::EP_TYPE::BULK:
			{
				ep_out->DOEPCTL = 
					USB_OTG_DOEPCTL_EPENA                     |
					USB_OTG_DIEPCTL_SD0PID_SEVNFRM            | 
					USB_OTG_DIEPCTL_CNAK                      | 
					_VAL2FLD(USB_OTG_DOEPCTL_EPTYP, 0x02)     | 
					USB_OTG_DIEPCTL_USBAEP                    | 
					_VAL2FLD(USB_OTG_DOEPCTL_MPSIZ, ep.size);
				break;
			}
			default:
			{
				return false;
			}
		}
	}

