jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
	return true;
}
bool stm32_h7xx_otghs::ep_unconfig(const uint8_t ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep);

	volatile USB_OTG_INEndpointTypeDef*  const ep_in  = get_ep_in(ep_addr);
	volatile USB_OTG_OUTEndpointTypeDef* const ep_out = get_ep_out(ep_addr);
	
	OTGD->DAINTMSK &= ~(0x00010001 << ep_addr);

	Register_util::clear_bits(&ep_in->DIEPCTL, USB_OTG_DIEPCTL_USBAEP);
	flush_tx(ep_addr);

	if(ep_addr != 0)
	{
		if(ep_in->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
		{
			Register_util::set_bits(&ep_in->DIEPCTL, USB_OTG_DIEPCTL_EPDIS);
		}
	}

	ep_in->DIEPINT = 
		(1U << 13) | 
		(1U << 11) | 
		(1U <<  8) | 
		(1U <<  7) | 
		(1U <<  6) | 
		(1U <<  5) | 
		(1U <<  4) | 
		(1U <<  3) | 
		(1U <<  2) | 
		(1U <<  1) | 
		(1U <<  0);

	if(ep_addr != 0)
	{
		OTG->DIEPTXF[ep_addr-1] = _VAL2FLD(USB_OTG_DIEPTXF_INEPTXFD, 0x0200) | _VAL2FLD(USB_OTG_DIEPTXF_INEPTXSA, 0x0200+0x0200*ep_addr);
	}

	Register_util::clear_bits(&ep_out->DOEPCTL, USB_OTG_DOEPCTL_USBAEP);
	if(ep_out->DOEPCTL & USB_OTG_DOEPCTL_EPENA)
	{
		Register_util::set_bits(&ep_out->DOEPCTL, USB_OTG_DOEPCTL_EPDIS);
	}
	ep_out->DOEPINT = 
		(1U << 14) | 
		(1U << 13) | 
		(1U << 12) | 
		(1U <<  8) | 
		(1U <<  7) | 
		(1U <<  6) | 
		(1U <<  5) | 
		(1U <<  4) | 
		(1U <<  3) | 
		(1U <<  2) | 
		(1U <<  1) | 
		(1U <<  0);

	return true;
}

bool stm32_h7xx_otghs::ep_is_stalled(const uint8_t ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep);
	bool is_stalled = false;

	if(USB_common::is_in_ep(ep))
	{
		volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_addr);

		is_stalled = epin->DIEPCTL & USB_OTG_DIEPCTL_STALL;
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_addr);

		is_stalled = epout->DOEPCTL & USB_OTG_DOEPCTL_STALL;
	}

	return is_stalled;
}
void stm32_h7xx_otghs::ep_stall(const uint8_t ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep);

	if(USB_common::is_in_ep(ep))
	{
		volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_addr);

		Register_util::set_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DIEPCTL_STALL);
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_addr);

		Register_util::set_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_STALL);
	}
}
void stm32_h7xx_otghs::ep_unstall(const uint8_t ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep);
	ep_cfg cfg;

	//todo handle OOB ep
	if(ep == 0)
	{
		cfg = get_ep0_config();
	}
	else if(USB_common::is_in_ep(ep))
	{
		get_tx_ep_config(ep, &cfg);
	}
	else
	{
		get_rx_ep_config(ep, &cfg);
	}

	if(USB_common::is_in_ep(ep))
	{
		volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_addr);

		Register_util::clear_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_STALL);

		if(ep_addr != 0)
		{
			if((cfg.type == EP_TYPE::BULK) || (cfg.type == EP_TYPE::INTERRUPT))
			{
				Register_util::set_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_SD0PID_SEVNFRM);
			}
		}
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_addr);

		Register_util::clear_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_STALL);
		if(ep_addr != 0)
		{
			if((cfg.type == EP_TYPE::BULK) || (cfg.type == EP_TYPE::INTERRUPT))
			{
				Register_util::set_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_SD0PID_SEVNFRM);
			}
		}
	}
}

int stm32_h7xx_otghs::ep_write(const uint8_t ep, const uint8_t* buf, const uint16_t len)
{
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs::ep_write", "");

	if(!USB_common::is_in_ep(ep))
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs::ep_write", "not an in ep");
		return -1;
	}

	const uint8_t ep_addr = USB_common::get_ep_addr(ep);

	volatile USB_OTG_INEndpointTypeDef* const epin = get_ep_in(ep_addr);

	const size_t len32 = (len + 3) / 4;

	//number of words availible
	const uint32_t DTXFSTS = epin->DTXFSTS;
	const uint32_t INEPTFSAV = _FLD2VAL(USB_OTG_DTXFSTS_INEPTFSAV, DTXFSTS);
	if(INEPTFSAV < len32)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs::ep_write", "wanted %d but only %d avail on 0x%02X", len32, INEPTFSAV, ep);
		return -1;
	}

	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs::ep_write", "ep%d", ep_addr);
	for(size_t i = 0; i < len; i++)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs::ep_write", "%02X ", buf[i]);
	}

	if(ep_addr == 0)
	{
		Register_util::mask_set_bits(
							&epin->DIEPTSIZ,
							USB_OTG_DIEPTSIZ_PKTCNT | USB_OTG_DIEPTSIZ_XFRSIZ,
							_VAL2FLD(USB_OTG_DIEPTSIZ_PKTCNT, 1) | _VAL2FLD(USB_OTG_DIEPTSIZ_XFRSIZ, len)
						);
		Register_util::mask_set_bits(
			&epin->DIEPCTL, 
			USB_OTG_DIEPCTL_SD0PID_SEVNFRM, 
			USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK);
	}
	else
	{
		if(epin->DIEPCTL & USB_OTG_DOEPCTL_EPENA)
		{
			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs::ep_write", "endpoint already active");
			return -1;
		}

		Register_util::mask_set_bits(
							&epin->DIEPTSIZ,
							USB_OTG_DIEPTSIZ_MULCNT | USB_OTG_DIEPTSIZ_PKTCNT | USB_OTG_DIEPTSIZ_XFRSIZ,
							_VAL2FLD(USB_OTG_DIEPTSIZ_MULCNT, 0) | _VAL2FLD(USB_OTG_DIEPTSIZ_PKTCNT, 1) | _VAL2FLD(USB_OTG_DIEPTSIZ_XFRSIZ, len)
						);
		
		Register_util::mask_set_bits(
			&epin->DIEPCTL,
			USB_OTG_DIEPCTL_STALL | USB_OTG_DIEPCTL_SD0PID_SEVNFRM,
			USB_OTG_DIEPCTL_CNAK  | USB_OTG_DIEPCTL_EPENA);
	}

	volatile uint32_t* const fifo = get_ep_fifo(ep_addr);
	for(size_t i = 0; i < len; i+=4)
	{
		const size_t u8_left = len - i;

		//copy all 4 if avail, otherwise only the remaining
		if(u8_left >= 4)
		{	
			const uint8_t b0 = buf[i + 0];
			const uint8_t b1 = buf[i + 1];
			const uint8_t b2 = buf[i + 2];
			const uint8_t b3 = buf[i + 3];

			*fifo = Byte_util::make_u32(b3, b2, b1, b0);
		}
		else
		{
			uint8_t b0, b1, b2;

			switch(u8_left)
			{
				case 1:
				{
					b0 = buf[i + 0];
					b1 = 0;
					b2 = 0;
					break;
				}
				case 2:
				{
					b0 = buf[i + 0];
					b1 = buf[i + 1];
					b2 = 0;
					break;
				}
				case 3:
				{
					b0 = buf[i + 0];
					b1 = buf[i + 1];
					b2 = buf[i + 2];
					break;
				}
				case 0:
				default:
				{
					b0 = 0;
					b1 = 0;
					b2 = 0;
					break;
				}
			}

			*fifo = Byte_util::make_u32(0, b2, b1, b0);
		}
	}

	return len;
}
int stm32_h7xx_otghs::ep_read(const uint8_t ep, uint8_t* const buf, const uint16_t max_len)
{
	//no data
	if(!(OTG->GINTSTS & USB_OTG_GINTSTS_RXFLVL))
	{
		return 0;
	}

	for(size_t i = 0; i < max_len; i += 4)
	{
		const uint32_t temp = *get_ep_fifo(0);

