jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
		const size_t bleft = max_len - i;
		if(bleft >= 4)
		{
			buf[i+0] = Byte_util::get_b0(temp);
			buf[i+1] = Byte_util::get_b1(temp);
			buf[i+2] = Byte_util::get_b2(temp);
			buf[i+3] = Byte_util::get_b3(temp);
		}
		else
		{
			switch(bleft)
			{
				case 1:
				{
					buf[i+0] = Byte_util::get_b0(temp);
					break;
				}
				case 2:
				{
					buf[i+0] = Byte_util::get_b0(temp);
					buf[i+1] = Byte_util::get_b1(temp);
					break;
				}
				case 3:
				{
					buf[i+0] = Byte_util::get_b0(temp);
					buf[i+1] = Byte_util::get_b1(temp);
					buf[i+2] = Byte_util::get_b2(temp);
					break;
				}
				default:
				{
					break;
				}
			}
		}
	}

	return max_len;
}

uint16_t stm32_h7xx_otghs::get_frame_number()
{
	return _FLD2VAL(USB_OTG_DSTS_FNSOF, OTGD->DSTS);
}
size_t stm32_h7xx_otghs::get_serial_number(uint8_t* const buf, const size_t maxlen)
{
	return 0;
}

USB_common::USB_SPEED stm32_h7xx_otghs::get_speed() const
{
	switch(_FLD2VAL(USB_OTG_DSTS_ENUMSPD, OTGD->DSTS))
	{
		case 0:
		{
			return USB_common::USB_SPEED::HS;
		}
		case 2:
		{
			return USB_common::USB_SPEED::LS;
		}
		case 1:
		case 3:
		default:
		{
			return USB_common::USB_SPEED::FS;
		}
	}
}

void stm32_h7xx_otghs::poll(const USB_common::Event_callback& func)
{
	// for(;;)
	// {

	// }
	// {
	// 	const char msg[] = "stm32_h7xx_otghs::poll\r\n";
	// 	HAL_UART_Transmit(&huart1, reinterpret_cast<uint8_t*>(const_cast<char*>(msg)), strlen(msg), -1);
	// }

	USB_common::USB_EVENTS event = USB_common::USB_EVENTS::NONE;
	uint8_t ep_num = 0;

	const uint32_t GINTSTS = OTG->GINTSTS;

	// {
	// 	Stack_string<128> msg;
	// 	msg.clear();
	// 	msg.sprintf("\tGINTSTS: 0x%08" PRIX32 "\r\n", OTG->GINTSTS);
	// 	msg.sprintf("\tGINTMSK: 0x%08" PRIX32 "\r\n", OTG->GINTMSK);
	// 	HAL_UART_Transmit(&huart1, reinterpret_cast<uint8_t*>(const_cast<char*>(msg.c_str())), msg.size(), -1);
	// }
	if(GINTSTS & USB_OTG_GINTSTS_MMIS)
	{
		OTG->GINTSTS = USB_OTG_GINTSTS_MMIS;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_MMIS");
	}
	else if(GINTSTS & USB_OTG_GINTSTS_OTGINT)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_OTGINT");
	}
	else if(GINTSTS & USB_OTG_GINTSTS_SRQINT)
	{
		OTG->GINTSTS = USB_OTG_GINTSTS_SRQINT;
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_SRQINT");
	}
	else if(GINTSTS & USB_OTG_GINTSTS_WKUINT)
	{
		OTG->GINTSTS = USB_OTG_GINTSTS_WKUINT;
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_WKUINT");
	}
	else if(GINTSTS & USB_OTG_GINTSTS_ESUSP)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_ESUSP");
	
		OTG->GINTSTS = USB_OTG_GINTSTS_ESUSP;

		event = USB_common::USB_EVENTS::EARLY_SUSPEND;
	}
	else if(GINTSTS & USB_OTG_GINTSTS_USBSUSP)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_USBSUSP");

		OTG->GINTSTS = USB_OTG_GINTSTS_USBSUSP;

		event = USB_common::USB_EVENTS::SUSPEND;
	}
	else if(GINTSTS & USB_OTG_GINTSTS_USBRST)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_USBRST");

		OTG->GINTSTS = USB_OTG_GINTSTS_USBRST;

		for(uint8_t i = 0; i <= MAX_NUM_EP; i++)
		{
			ep_unconfig(i);
		}

		flush_rx();
		flush_all_tx();

		event = USB_common::USB_EVENTS::RESET;
	}
	else if(GINTSTS & USB_OTG_GINTSTS_ENUMDNE)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_ENUMDNE");

		OTG->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;

		event = USB_common::USB_EVENTS::ENUM_DONE;
	}
	else if(GINTSTS & USB_OTG_GINTSTS_SOF)
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_SOF");

		OTG->GINTSTS = USB_OTG_GINTSTS_SOF;

		//only emit the SOF event if we are asked to interrupt for SOF
		if(OTG->GINTMSK & USB_OTG_GINTSTS_SOF)
		{
			event = USB_common::USB_EVENTS::SOF;
		}
	}
	else if(GINTSTS & USB_OTG_GINTSTS_IEPINT)
	{
		if(!handle_iepintx(&event, &ep_num))
		{
			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "handle_iepintx had an error");
		}
	}
	else if(GINTSTS & USB_OTG_GINTSTS_OEPINT)
	{
		if(!handle_oepintx(&event, &ep_num))
		{
			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "handle_oepintx had an error");
		}
	}
	else if(GINTSTS & USB_OTG_GINTSTS_RXFLVL)
	{
		//pop top fifo entry
		const uint32_t GRXSTSP = OTG->GRXSTSP;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL GINTSTS 0x%08X", GINTSTS);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL GRXSTSP 0x%08X", GRXSTSP);

		const uint32_t STSPHST = (GRXSTSP & 0x08000000) >> 27;
		const uint32_t FRMNUM  = (GRXSTSP & 0x01E00000) >> 21;
		const uint32_t PKTSTS  = _FLD2VAL(USB_OTG_GRXSTSP_PKTSTS, GRXSTSP);
		const uint32_t DPID    = _FLD2VAL(USB_OTG_GRXSTSP_DPID,   GRXSTSP);
		const uint32_t BCNT    = _FLD2VAL(USB_OTG_GRXSTSP_BCNT,   GRXSTSP);
		const uint32_t EPNUM   = _FLD2VAL(USB_OTG_GRXSTSP_EPNUM,  GRXSTSP);
		ep_num = EPNUM;

		Stack_string<128> msg;
		msg.clear();
		msg.sprintf("\tSTSPHST %" PRIu32 "\r\n", STSPHST);
		msg.sprintf("\tFRMNUM  %" PRIu32 "\r\n", FRMNUM);
		msg.sprintf("\tPKTSTS  %" PRIu32 "\r\n", PKTSTS);
		msg.sprintf("\tDPID    %" PRIu32 "\r\n", DPID);
		msg.sprintf("\tBCNT    %" PRIu32 "\r\n", BCNT);
		msg.sprintf("\tEPNUM   %" PRIu32,        EPNUM);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "GRXSTSP:\r\n%s", msg.c_str());

		switch(PKTSTS)
		{
			case 2://out rx
			{
				Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL 2");

				if(BCNT != 0)
				{
					if(ep_num != 0)
					{
						//get active buffer
						Buffer_adapter_base* curr_buf = m_rx_buffer->get_buffer(ep_num);

