jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
						//read data from core's fifo into buffer
						curr_buf->reset();
						curr_buf->resize(BCNT);
						ep_read(ep_num, curr_buf->data(), BCNT);

						//enqueue buffer so the application thread can be notified and read it
						if(m_rx_buffer->poll_enqueue_buffer(ep_num, curr_buf))
						{
							Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL PKTSTS 2 rx buffer poll_enqueue_buffer ok");
						}
						else
						{
							Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL PKTSTS 2 rx buffer poll_enqueue_buffer fail");
						}

						for(size_t i = 0; i < BCNT; i++)
						{
							Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL %02X ", curr_buf->data()[i]);
						}

						//try to get a new buffer
						Buffer_adapter_base* new_buf = m_rx_buffer->poll_allocate_buffer(ep_num);
						//update the active buffer
						if(new_buf)
						{
							new_buf->reset();
							m_rx_buffer->set_buffer(ep_num, new_buf);
							get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
						}
						else
						{
							//OUT buffer underrun
							//we will need to cnak and epena when the app frees a buffer
							Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL rx buffer allocation fail");
							m_rx_buffer->set_buffer(ep_num, nullptr);
							get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_SNAK);
						}
					}
					else
					{
						//get active buffer
						Buffer_adapter_base* curr_buf = m_ep0_buffer->get_buffer(0);

						//read data from core's fifo into buffer
						curr_buf->reset();
						curr_buf->resize(BCNT);
						ep_read(0, curr_buf->data(), BCNT);

						//enqueue buffer so the application thread can be notified and read it
						m_ep0_buffer->poll_enqueue_buffer(0, curr_buf);

						for(size_t i = 0; i < BCNT; i++)
						{
							Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL %02X ", curr_buf->data()[i]);
						}

						//try to get a new buffer
						Buffer_adapter_base* new_buf = m_ep0_buffer->poll_allocate_buffer(0);
						//update the active buffer
						if(new_buf)
						{
							new_buf->reset();
							m_ep0_buffer->set_buffer(0, new_buf);
							get_ep_out(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
						}
						else
						{
							//OUT buffer underrun
							//we will need to cnak and epena when the app frees a buffer
							Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL rx buffer allocation fail");
							m_ep0_buffer->set_buffer(0, nullptr);
							get_ep_out(0)->DOEPCTL |= (USB_OTG_DOEPCTL_SNAK);
						}
					}
				}

				break;
			}
			case 3://out txfr done
			{
				Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL OUT TXFR DONE");

				//rearm ep, dispatch will occur in USB_OTG_DOEPINT_XFRC

				//get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
				break;
			}
			case 6://setup packet rx
			{
				Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL pksts 6");

				if(BCNT != 0)
				{
					ep_read(ep_num, m_last_setup_packet.data(), BCNT);

					for(size_t i = 0; i < m_last_setup_packet.size(); i++)
					{
						Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL %02X ", m_last_setup_packet[i]);
					}
				}

				break;
			}
			case 4://setup stage done, data stage started
			{
				Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL pksts 4");

				Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_RXFLVL event SETUP_PACKET_RX");

				get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
				break;
			}
			case 1://global nak
			default:
			{
				break;
			}
		}
	}

	//don't callback if there is nothing to do
	//otherwise the usb core thread will wake
	if(event != USB_common::USB_EVENTS::NONE)
	{
		func(event, ep_num);
	}
}

void stm32_h7xx_otghs::set_data0(const uint8_t ep)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep);

	if(USB_common::is_in_ep(ep))
	{
		volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_addr);

		Register_util::set_bits(&epin->DIEPCTL, USB_OTG_DIEPCTL_SD0PID_SEVNFRM);
	}
	else
	{
		volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_addr);

		Register_util::set_bits(&epout->DOEPCTL, USB_OTG_DOEPCTL_SD0PID_SEVNFRM);
	}
}

void stm32_h7xx_otghs::flush_rx()
{
	//verify rx read idle
	//???
	//verify rx write idle
	//???

	Register_util::set_bits(&OTG->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
}

void stm32_h7xx_otghs::flush_tx(const uint8_t ep)
{
	//verify tx read idle
	//???
	//verify tx write idle
	Register_util::wait_until_set(&OTG->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL);

	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_TXFFLSH);

	Register_util::mask_set_bits(
		&OTG->GRSTCTL, 
		USB_OTG_GRSTCTL_TXFNUM, 
		_VAL2FLD(USB_OTG_GRSTCTL_TXFNUM, ep) | USB_OTG_GRSTCTL_TXFFLSH
	);

	Register_util::wait_until_clear(&OTG->GRSTCTL, USB_OTG_GRSTCTL_TXFFLSH);
}

void stm32_h7xx_otghs::flush_all_tx()
{
	flush_tx(0x20);
}

const usb_driver_base::ep_cfg& stm32_h7xx_otghs::get_ep0_config() const
{
	return m_ep0_cfg;
}
bool stm32_h7xx_otghs::get_rx_ep_config(const uint8_t addr, ep_cfg* const out_ep)
{
	if(addr > MAX_NUM_EP)
	{
		return false;
	}

	*out_ep = m_tx_ep_cfg[addr - 1];
	return true;
}
bool stm32_h7xx_otghs::get_tx_ep_config(const uint8_t addr, ep_cfg* const out_ep)
{
	if(addr > MAX_NUM_EP)
	{
		return false;
	}
	
	*out_ep = m_tx_ep_cfg[addr - 1];
	return true;
}

//application waits for a buffer with data
//this might be better as a stream thing rather than buffer exchange
Buffer_adapter_base* stm32_h7xx_otghs::wait_rx_buffer(const uint8_t ep_num)
{
	return m_rx_buffer->wait_dequeue_buffer(ep_num);
}
//application returns rx buffer to driver. will allow reception to continue in event of buffer underrun
void stm32_h7xx_otghs::release_rx_buffer(const uint8_t ep_num, Buffer_adapter_base* const buf)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);
	
