jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
	m_rx_buffer->release_buffer(ep_addr, buf);

	//TODO: we may need to mask usb isr here
	//it might be safe for now, since we only do this if the ep has no loaded OUT buffer
	//which means that NAK is set
	if(m_rx_buffer->get_buffer(ep_addr) == nullptr)
	{
		//clear a OUT nak, since we have a new buffer to read to

		Buffer_adapter_base* act_buf = m_rx_buffer->poll_allocate_buffer(ep_addr);
		
		m_rx_buffer->set_buffer(ep_addr, act_buf);

		get_ep_out(ep_num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	}
}

//application wait for usable tx buffer
Buffer_adapter_base* stm32_h7xx_otghs::wait_tx_buffer(const uint8_t ep_num)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);

	return m_tx_buffer->wait_allocate_buffer(ep_addr);
}
//application give buffer to driver for transmission
bool stm32_h7xx_otghs::enqueue_tx_buffer(const uint8_t ep_num, Buffer_adapter_base* const buf)
{
	const uint8_t ep_addr = USB_common::get_ep_addr(ep_num);

	//TODO: we may need to mask usb isr here
	//it might be safe for now, since we only do this if the ep has no loaded IN buffer
	//which means that NAK is set

	if(m_tx_buffer->get_buffer(ep_addr) == nullptr)
	{
		m_tx_buffer->set_buffer(ep_addr, buf);

		ep_write(ep_num, buf->data(), buf->size());
	}
	else
	{
		if(!m_tx_buffer->poll_enqueue_buffer(ep_addr, buf))
		{
			Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::error, "stm32_h7xx_otghs", "Failed to enqueue buffer");
			return false;
		}
	}

	return true;
}

bool stm32_h7xx_otghs::handle_iepintx(USB_common::USB_EVENTS* const out_event, uint8_t* const out_ep_num)
{
	const uint32_t IEPINT = _FLD2VAL(USB_OTG_DAINT_IEPINT, OTGD->DAINT);

	if(IEPINT == 0)
	{
		return true;
	}

	USB_common::USB_EVENTS event = USB_common::USB_EVENTS::NONE;
	uint8_t ep_num = __builtin_ctz(IEPINT);

	volatile USB_OTG_INEndpointTypeDef* epin = get_ep_in(ep_num);
	const uint32_t DIEPINT = epin->DIEPINT;

	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT %d IEPINT  0x%08X", ep_num, IEPINT);
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT %d DIEPINT 0x%08X", ep_num, DIEPINT);

	if(DIEPINT & USB_OTG_DIEPINT_NAK)//NAK is tx or rx
	{
		epin->DIEPINT = USB_OTG_DIEPINT_NAK;
	}
	// else if(DIEPINT & USB_OTG_DIEPINT_BERR)//b12 is reserved
	// {

	// }
	else if(DIEPINT & USB_OTG_DIEPINT_PKTDRPSTS)//ISOC out packet has been dropped
	{
		epin->DIEPINT = USB_OTG_DIEPINT_PKTDRPSTS;
		//does not interrupt
	}
	// else if(DIEPINT & USB_OTG_DIEPINT_BNA)//b9 is reserved
	// {

	// }
	else if(DIEPINT & USB_OTG_DIEPINT_TXFIFOUDRN)//tx fifo underrn, thresholding must be enabled
	{
		epin->DIEPINT = USB_OTG_DIEPINT_TXFIFOUDRN;
	}
	// else if(DIEPINT & USB_OTG_DIEPINT_TXFE)
	// {
	// 	//transmit fifo empty
	// 	//half or completely based on GAHBCFG
	// }
	// else if(DIEPINT & USB_OTG_DIEPINT_INEPNE)//IN EPNE - in ep nak effective
	// {
	// 	//clear by writing CNAK in diepctlx
	// }
	else if(DIEPINT & 1U << 5)//IN EPNM - in token received with ep mismatch
	{
		epin->DIEPINT = 1U << 5;
	}
	else if(DIEPINT & USB_OTG_DIEPINT_ITTXFE)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_ITTXFE;
	}
	else if(DIEPINT & USB_OTG_DIEPINT_TOC)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_TOC;
						Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT DIEPINT[%d] TOC 0x%08X", ep_num, DIEPINT);
	}
	else if(DIEPINT & 1U << 2)//AHB error
	{
		epin->DIEPINT = 1U << 2;
	}
	else if(DIEPINT & USB_OTG_DIEPINT_EPDISD)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_EPDISD;
	}
	else if(DIEPINT & USB_OTG_DIEPINT_XFRC)
	{
		epin->DIEPINT = USB_OTG_DIEPINT_XFRC;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT DIEPINT[%d] XFRC 0x%08X", ep_num, DIEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT event EP_TX");

		{
			Buffer_adapter_base* const curr_tx_buf = m_tx_buffer->get_buffer(ep_num);
			if(curr_tx_buf)
			{
				m_tx_buffer->release_buffer(ep_num, curr_tx_buf);
			}
		}

		//see if there is a new packet to enqueue
		Buffer_adapter_base* const new_tx_buf = m_tx_buffer->poll_dequeue_buffer(ep_num);
		if(new_tx_buf)
		{
			m_tx_buffer->set_buffer(ep_num, new_tx_buf);
			ep_write(0x80 | ep_num, new_tx_buf->data(), new_tx_buf->size());
		}
		else
		{
			m_tx_buffer->set_buffer(ep_num, nullptr);
			get_ep_in(ep_num)->DIEPCTL |= (USB_OTG_DOEPCTL_SNAK);
		}

		if(ep_num == 0)
		{
			event = USB_common::USB_EVENTS::EP_TX;
			ep_num = ep_num | 0x80;
		}
	}
	else
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT %d IEPINT  0x%08X",  ep_num, IEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT %d DIEPINT 0x%08X", ep_num, DIEPINT);
	}

	*out_event = event;
	*out_ep_num = ep_num;

	return true;
}

bool stm32_h7xx_otghs::handle_oepintx(USB_common::USB_EVENTS* const out_event, uint8_t* const out_ep_num)
{
	const uint32_t OEPINT = _FLD2VAL(USB_OTG_DAINT_OEPINT, OTGD->DAINT);

	if(OEPINT == 0)
	{
		return true;
	}

	USB_common::USB_EVENTS event = USB_common::USB_EVENTS::NONE;
	uint8_t ep_num = __builtin_ctz(OEPINT);

	volatile USB_OTG_OUTEndpointTypeDef* epout = get_ep_out(ep_num);
	const uint32_t DOEPINT = epout->DOEPINT;

	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_OEPINT %d OEPINT  0x%08X", ep_num, OEPINT);
	Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::trace, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_OEPINT %d DOEPINT 0x%08X", ep_num, DOEPINT);

	if(DOEPINT & 1U << 15)//STPKTRX
	{
		//setup packet received in buffer dma mode
		epout->DOEPINT = 1U << 15;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_NYET)
	{
		epout->DOEPINT = USB_OTG_DOEPINT_NYET;
	}
	else if(DOEPINT & 1U << 13)//NAK
	{
		epout->DOEPINT = 1U << 13;
	}
	else if(DOEPINT & 1U << 12)//BERR - babble error
	{
		epout->DOEPINT = 1U << 12;
	}
	else if(DOEPINT & 1U << 8)//OUTPKTERR - overflow or crc error
	{
		epout->DOEPINT = 1U << 8;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_B2BSTUP)//back to back setup, more than 3 rxd
	{
		epout->DOEPINT = USB_OTG_DOEPINT_B2BSTUP;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_OTEPSPR)//status phase - host switched from data phase to status phase
	{
		//really STSPHSRX
		//status phase received for control write
		//core has rxd all the data the host will send
		epout->DOEPINT = USB_OTG_DOEPINT_OTEPSPR;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_OEPINT DOEPINT[%d] OTEPSPR 0x%08X", ep_num, DOEPINT);

		//Status phase received for control write
		//we are now in status phase, send an ACK or stall for the status phase

		event = USB_common::USB_EVENTS::CTRL_DATA_PHASE_DONE;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_OTEPDIS)//out token received when endpoint disabled
	{
		epout->DOEPINT = USB_OTG_DOEPINT_OTEPDIS;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_STUP)//setup phase done - control endpoint has setup packet and no more came in, decode it now
	{
		epout->DOEPINT = USB_OTG_DOEPINT_STUP;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_OEPINT DOEPINT[%d] STUP 0x%08X", ep_num, DOEPINT);

