jacobschloss/libusb_dev_cpp/src/driver/stm32/stm32_h7xx_otghs.cpp
		//SETUP phase done
		//no more back to back setup packets
		//decode the setup packet now

		const uint32_t DOEPTSIZ = get_ep_out(ep_num)->DOEPTSIZ;

		const uint32_t XFRSIZ  = _FLD2VAL(USB_OTG_DOEPTSIZ_XFRSIZ, DOEPTSIZ);
		const uint32_t PKTCNT  = _FLD2VAL(USB_OTG_DOEPTSIZ_PKTCNT, DOEPTSIZ);
		const uint32_t STUPCNT = _FLD2VAL(USB_OTG_DOEPTSIZ_STUPCNT, DOEPTSIZ);

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_DOEPINT_STUP XFRSIZ %08X", XFRSIZ);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_DOEPINT_STUP PKTCNT %08X", PKTCNT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_DOEPINT_STUP STUPCNT %08X", STUPCNT);

		event = USB_common::USB_EVENTS::CTRL_SETUP_PHASE_DONE;
	}
	else if(DOEPINT & 1U << 2)//AHB error
	{
		epout->DOEPINT = 1U << 2;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_EPDISD)//core acks that app requested ep is disabled
	{
		epout->DOEPINT = USB_OTG_DOEPINT_EPDISD;
	}
	else if(DOEPINT & USB_OTG_DOEPINT_XFRC)//programmed transfer is complete for this endpoint on AHB and USB
	{
		epout->DOEPINT = USB_OTG_DOEPINT_XFRC;

		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_OEPINT DOEPINT[%d] XFRC 0x%08X", ep_num, DOEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_DOEPINT_XFRC event EP_RX");

		if(ep_num == 0)
		{
			event = USB_common::USB_EVENTS::EP_RX;
		}
	}
	else
	{
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT %d OEPINT  0x%08X",  ep_num, OEPINT);
		Global_logger::get()->log(freertos_util::logging::LOG_LEVEL::debug, "stm32_h7xx_otghs", "USB_OTG_GINTSTS_IEPINT %d DOEPINT 0x%08X", ep_num, DOEPINT);		
	}

	*out_event = event;
	*out_ep_num = ep_num;

	return true;
}
